
// ---------------------------------------------------
 // main.cpp
// g++ Conjunto.cpp main.cpp
// ---------------------------------------------------

#include <iostream>
#include "conjunto.h"
using namespace std;

// ---------------------------------------------------
// ---------------------------------------------------

void probarTalla() {

}

// ---------------------------------------------------
// ---------------------------------------------------

void probarOtraCosa() {
  cout << " parece que esta prueba funciona ... ";
  cout << " pero es porque no he probado nada aún :-) \n";
}

// ---------------------------------------------------
// ---------------------------------------------------

int main() {

  double lista1 [5] = {1,2,3,4,5};

  Conjunto a = Conjunto (&lista1[0], 5);


}
